Revit 2026 API

# IFCFileModelOptionsSchemaFile Property

---

The full name of an IFC schema file.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SchemaFile { get; set; }
```
```vb
Public Property SchemaFile As String
	Get
	Set
```
```cpp
public:
property String^ SchemaFile {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SchemaFile : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace